app/Filament/Resources/AssetResource/Widgets/AssetsOverview.php

select `id` from `master_assets_status` where `name` = 'inactive' limit 1
select `id` from `master_assets_category` where `name` = 'elektronik' limit 1
select `id` from `master_assets_category` where `name` = 'furnitur' limit 1
select count(*) as aggregate from `assets`
select count(*) as aggregate from `assets` where `status_id` = '54a77b58-1df8-478f-930b-8fcad394dbbc'
select count(*) as aggregate from `assets` where `status_id` = 'e8ca1f46-08fc-45c1-a619-5d8bd142a755'
select count(*) as aggregate from `assets` where `category_id` = '2d0e8049-ae7a-4062-9d1d-a2536c1ddb74'
select count(*) as aggregate from `assets` where `category_id` = 'c0cdbec2-60ea-442d-b74f-cc1b93969a1e'
select count(*) as aggregate from `assets` where `category_id` = '00b1c7a9-5e92-4ba0-ac9c-19a26d15e871'
---
    protected function getStats(): array
    {
        // Ambil UUID untuk status 'active' dan 'inactive' dari tabel master_assets_status
        $activeStatusId = \DB::table('master_assets_status')
            ->where('name', 'active')
            ->value('id'); // Ambil UUID untuk status 'active'

        $inactiveStatusId = \DB::table('master_assets_status')
            ->where('name', 'inactive')
            ->value('id'); // Ambil UUID untuk status 'inactive'
        $categoryAssetElec = \DB::table('master_assets_category')
            ->where('name', 'elektronik')
            ->value('id'); // Ambil UUID untuk status 'active'

        $categoryAssetFurnitur = \DB::table('master_assets_category')
            ->where('name', 'furnitur')
            ->value('id'); // Ambil UUID untuk status 'active'

        $categoryAssetKendaraan = \DB::table('master_assets_category')
            ->where('name', 'Kendaraan')
            ->value('id'); // Ambil UUID untuk status 'inactive' = \DB::table('master_assets_status')


        // Hitung total aset
        $totalAssets = Asset::count();

        // Hitung total aset dengan status 'active'
        $totalAssetsActive = Asset::where('status_id', $activeStatusId)->count();

        // Hitung total aset dengan status 'inactive'
        $totalAssetsInactive = Asset::where('status_id', $inactiveStatusId)->count();

        $totalCategoryElec = Asset::where('category_id', $categoryAssetElec)->count();
        $totalCategoryFurnitur = Asset::where('category_id', $categoryAssetFurnitur)->count();
        $totalCategoryKendaraan = Asset::where('category_id', $categoryAssetKendaraan)->count();