app/Filament/Resources/EmployeeJobApplicationArchivesResource/Widgets/EmployeeJobApplicationOverview.php

select count(*) as aggregate from `employee_job_application_archives` where `employee_job_application_archives`.`deleted_at` is null
select count(*) as aggregate from `employee_job_application_archives` where `application_status` = 1 and `employee_job_application_archives`.`deleted_at` is null
select count(*) as aggregate from `employee_job_application_archives` where `application_status` = 0 and `employee_job_application_archives`.`deleted_at` is null
---
    protected function getStats(): array
    {
        // Count total job applications
        $totalApplications = EmployeeJobApplicationArchives::count();

        // Count approved job applications (application_status = true)
        $approvedApplications = EmployeeJobApplicationArchives::where('application_status', true)->count();

        // Count pending job applications (application_status = false)
        $pendingApplications = EmployeeJobApplicationArchives::where('application_status', false)->count();