app/Filament/Resources/AssetMutationResource/Widgets/AssetMutationOverview.php

select `id` from `master_assets_transaction_status` where `name` like '%transaksi keluar%' limit 1
select `id` from `master_assets_transaction_status` where `name` like '%transaksi masuk%' limit 1
---
    protected function getStats(): array
    {

        // Ambil UUID untuk status yang mirip dengan 'transaksi keluar' dan 'transaksi masuk' dari tabel master_assets_transaction_status
        $mutationOut = \DB::table('master_assets_transaction_status')
            ->where('name', 'like', '%transaksi keluar%') // Gunakan wildcard untuk pencocokan yang fleksibel
            ->value('id'); // Ambil UUID untuk status transaksi keluar

        $mutationIn = \DB::table('master_assets_transaction_status')
            ->where('name', 'like', '%transaksi masuk%') // Gunakan wildcard untuk pencocokan yang fleksibel
            ->value('id'); // Ambil UUID untuk status transaksi masuk