app/Filament/Resources/EmployeesResource/Widgets/EmployeesGradeOverview.php

select count(*) as aggregate from `employees` where `employee_grade_id` = (select `id` from `master_employee_grade` where `name` = 'A2') and `employees`.`deleted_at` is null
---
    protected function getData(): array
    {
        // Ambil semua golongan dari master_employee_basic_salary
        $gradeEmployee = MasterEmployeeGrade::all()->pluck('name');

        // Inisialisasi array untuk menyimpan jumlah pegawai berdasarkan golongan
        $basicSalaryCounts = [];

        // Hitung pegawai berdasarkan golongan
        foreach ($gradeEmployee as $grade) {
            $basicSalaryCounts[$grade] = Employees::where('employee_grade_id', function ($query) use ($grade) {
                $query->select('id')->from('master_employee_grade')->where('name', $grade);
            })->count();