app/Filament/Resources/EmployeesResource/Widgets/EmployeesGenderChartOverview.php

select count(*) as aggregate from `employees` where `employees`.`deleted_at` is null
select count(*) as aggregate from `employees` where `gender` = 'Laki-Laki' and `employees`.`deleted_at` is null
select count(*) as aggregate from `employees` where `gender` = 'Perempuan' and `employees`.`deleted_at` is null
---
    protected function getData(): array
    {
        $totalEmployees = Employees::count();

        $pegawaiLakiLaki = Employees::where('gender', 'Laki-Laki')->count();
        $pegawaiPerempuan = Employees::where('gender', 'Perempuan')->count();