app/Filament/Resources/EmployeesResource/Widgets/EmployeesAgeOverview.php

select * from `employees` where `employees`.`deleted_at` is null
---
    protected function getData(): array
    {
        // Define age ranges
        $ageRanges = [
            '20-29' => 0,
            '30-39' => 0,
            '40-49' => 0,
            '50-59' => 0,
        ];

        // Get all employees
        $employees = Employees::all();