app/Filament/Resources/EmployeesResource/Widgets/EmployeesAgreementOverview.php

select count(*) as aggregate from `employees` where `employees`.`deleted_at` is null
select count(*) as aggregate from `employees` where `master_employee_agreement_id` in (select `id` from `master_employee_agreement` where `name` LIKE '%[PKWT] Perjanjian Kerja Waktu Tertentu%') and `employees`.`deleted_at` is null
select count(*) as aggregate from `employees` where `master_employee_agreement_id` in (select `id` from `master_employee_agreement` where `name` LIKE '%[PKWTT] Perjanjian Kerja Waktu Tidak Tertentu%') and `employees`.`deleted_at` is null
---
    protected function getStats(): array
    {
        $query = Employees::query();

        $totalEmployees = $query->count();
        $pkwtCount = Employees::whereIn('master_employee_agreement_id', function ($query) {
            $query->select('id')->from('master_employee_agreement')->where('name', 'LIKE', '%[PKWT] Perjanjian Kerja Waktu Tertentu%');
        })->count();

        $pkwttCount = Employees::whereIn('master_employee_agreement_id', function ($query) {
            $query->select('id')->from('master_employee_agreement')->where('name', 'LIKE', '%[PKWTT] Perjanjian Kerja Waktu Tidak Tertentu%');
        })->count();