app/Filament/Resources/EmployeesResource/Widgets/EmployeesEducationOverview.php

select count(*) as aggregate from `employees` where `employee_education_id` = (select `id` from `master_employee_education` where `name` = 'SD') and `employees`.`deleted_at` is null
select count(*) as aggregate from `employees` where `employee_education_id` = (select `id` from `master_employee_education` where `name` = 'SMP') and `employees`.`deleted_at` is null
select count(*) as aggregate from `employees` where `employee_education_id` = (select `id` from `master_employee_education` where `name` = 'SMA') and `employees`.`deleted_at` is null
select count(*) as aggregate from `employees` where `employee_education_id` = (select `id` from `master_employee_education` where `name` = 'D1') and `employees`.`deleted_at` is null
select count(*) as aggregate from `employees` where `employee_education_id` = (select `id` from `master_employee_education` where `name` = 'D3') and `employees`.`deleted_at` is null
select count(*) as aggregate from `employees` where `employee_education_id` = (select `id` from `master_employee_education` where `name` = 'D4') and `employees`.`deleted_at` is null
select count(*) as aggregate from `employees` where `employee_education_id` = (select `id` from `master_employee_education` where `name` = 'S1') and `employees`.`deleted_at` is null
select count(*) as aggregate from `employees` where `employee_education_id` = (select `id` from `master_employee_education` where `name` = 'S2') and `employees`.`deleted_at` is null
---
    protected function getData(): array
    {
        // Count employees based on education level
        $sdCount = Employees::where('employee_education_id', function ($query) {
            $query->select('id')->from('master_employee_education')->where('name', 'SD');
        })->count();

        $smpCount = Employees::where('employee_education_id', function ($query) {
            $query->select('id')->from('master_employee_education')->where('name', 'SMP');
        })->count();

        $smaCount = Employees::where('employee_education_id', function ($query) {
            $query->select('id')->from('master_employee_education')->where('name', 'SMA');
        })->count();

        $d1Count = Employees::where('employee_education_id', function ($query) {
            $query->select('id')->from('master_employee_education')->where('name', 'D1');
        })->count();

        $d3Count = Employees::where('employee_education_id', function ($query) {
            $query->select('id')->from('master_employee_education')->where('name', 'D3');
        })->count();

        $d4Count = Employees::where('employee_education_id', function ($query) {
            $query->select('id')->from('master_employee_education')->where('name', 'D4');
        })->count();

        $s1Count = Employees::where('employee_education_id', function ($query) {
            $query->select('id')->from('master_employee_education')->where('name', 'S1');
        })->count();

        $s2Count = Employees::where('employee_education_id', function ($query) {
            $query->select('id')->from('master_employee_education')->where('name', 'S2');
        })->count();