app/Filament/Resources/EmployeesResource/Widgets/EmployeesOverview.php

    protected function getStats(): array
    {
        // Employee counts by status
        $pegawaiTetap = Employees::whereIn('employment_status_id', function ($query) {
            $query->select('id')->from('master_employee_status_employement')->where('name', 'LIKE', '%Pegawai%');
        })->count();

        $calonPegawai = Employees::whereIn('employment_status_id', function ($query) {
            $query->select('id')->from('master_employee_status_employement')->where('name', 'LIKE', '%Calon Pegawai%');
        })->count();

        $pegawaiKontrak = Employees::whereIn('employment_status_id', function ($query) {
            $query->select('id')->from('master_employee_status_employement')->where('name', 'LIKE', '%Kontrak%');
        })->count();

        $pegawaiTHL = Employees::whereIn('employment_status_id', function ($query) {
            $query->select('id')->from('master_employee_status_employement')->where('name', 'LIKE', '%Tenaga Harian Lepas%');
        })->count();
---
select count(*) as aggregate from `employees` where `employment_status_id` in (select `id` from `master_employee_status_employement` where `name` LIKE '%Pegawai%') and `employees`.`deleted_at` is null
select count(*) as aggregate from `employees` where `employment_status_id` in (select `id` from `master_employee_status_employement` where `name` LIKE '%Calon Pegawai%') and `employees`.`deleted_at` is null
select count(*) as aggregate from `employees` where `employment_status_id` in (select `id` from `master_employee_status_employement` where `name` LIKE '%Kontrak%') and `employees`.`deleted_at` is null
select count(*) as aggregate from `employees` where `employment_status_id` in (select `id` from `master_employee_status_employement` where `name` LIKE '%Tenaga Harian Lepas%') and `employees`.`deleted_at` is null