app/Filament/Resources/EmployeeAgreementResource/Widgets/AgreementOverview.php

    protected function getStats(): array
    {
        $total = EmployeeAgreement::count();
        $totalThisYear = EmployeeAgreement::whereYear('agreement_date_start', Carbon::now()->year)->count();
        $totalThisMonth = EmployeeAgreement::whereYear('agreement_date_start', Carbon::now()->year)
            ->whereMonth('agreement_date_start', Carbon::now()->month)
            ->count();
---
select count(*) as aggregate from `employee_agreement` where `employee_agreement`.`deleted_at` is null
select count(*) as aggregate from `employee_agreement` where year(`agreement_date_start`) = 2024 and `employee_agreement`.`deleted_at` is null
select count(*) as aggregate from `employee_agreement` where year(`agreement_date_start`) = 2024 and month(`agreement_date_start`) = '11' and `employee_agreement`.`deleted_at` is null