app/Filament/Resources/EmployeeBusinessTravelLettersResource/Widgets/EmployeeBusinessTravelOverview.php

    protected function getStats(): array
    {
        $total = EmployeeBusinessTravelLetters::count();
        $totalThisYear = EmployeeBusinessTravelLetters::whereYear('start_date', Carbon::now()->year)->count();
        $totalThisMonth = EmployeeBusinessTravelLetters::whereYear('start_date', Carbon::now()->year)
            ->whereMonth('start_date', Carbon::now()->month)
            ->count();
        $totalToday = EmployeeBusinessTravelLetters::whereDate('start_date', Carbon::today())->count();
---
select count(*) as aggregate from `employee_business_travel_letters` where `employee_business_travel_letters`.`deleted_at` is null
select count(*) as aggregate from `employee_business_travel_letters` where year(`start_date`) = 2024 and `employee_business_travel_letters`.`deleted_at` is null
select count(*) as aggregate from `employee_business_travel_letters` where year(`start_date`) = 2024 and month(`start_date`) = '11' and `employee_business_travel_letters`.`deleted_at` is null
select count(*) as aggregate from `employee_business_travel_letters` where date(`start_date`) = '2024-11-07' and `employee_business_travel_letters`.`deleted_at` is null