app/Filament/Resources/EmployeeAssignmentLettersResource/Widgets/EmployeeAssignmentOverview.php

    protected function getStats(): array
    {
        $total = EmployeeAssignmentLetters::count();
        $totalThisYear = EmployeeAssignmentLetters::whereYear('start_date', Carbon::now()->year)->count();
        $totalThisMonth = EmployeeAssignmentLetters::whereYear('start_date', Carbon::now()->year)
            ->whereMonth('start_date', Carbon::now()->month)
            ->count();
        $totalToday = EmployeeAssignmentLetters::whereDate('start_date', Carbon::today())->count();
---
select count(*) as aggregate from `employee_assignment_letters` where `employee_assignment_letters`.`deleted_at` is null
select count(*) as aggregate from `employee_assignment_letters` where year(`start_date`) = 2024 and `employee_assignment_letters`.`deleted_at` is null
select count(*) as aggregate from `employee_assignment_letters` where year(`start_date`) = 2024 and month(`start_date`) = '11' and `employee_assignment_letters`.`deleted_at` is null
select count(*) as aggregate from `employee_assignment_letters` where date(`start_date`) = '2024-11-08' and `employee_assignment_letters`.`deleted_at` is null