app/Filament/Widgets/AssetsWidget.php

    protected function getData(): array
    {
        // Hitung jumlah pegawai berdasarkan employment_status_id
        $baikCount = Asset::where('condition_id', '8b1b5470-8a6b-4dcd-83dc-ee6a06d8767f')->count();
        $baruCount = Asset::where('condition_id', '063935c4-95b6-4ed7-a73a-49196dad5ad5')->count();
        $rusakCount = Asset::where('condition_id', 'b76b1100-c4e9-45cc-89f3-06347acdd6ef')->count();
---
select count(*) as aggregate from `assets` where `condition_id` = '8b1b5470-8a6b-4dcd-83dc-ee6a06d8767f'
select count(*) as aggregate from `assets` where `condition_id` = '063935c4-95b6-4ed7-a73a-49196dad5ad5'
select count(*) as aggregate from `assets` where `condition_id` = 'b76b1100-c4e9-45cc-89f3-06347acdd6ef'