app/Filament/Widgets/EmployeesWidget.php

select count(*) as aggregate from `employees` where `employment_status_id` = '60918c6d-f161-4a7c-a33b-29231dc23013' and `employees`.`deleted_at` is null
select count(*) as aggregate from `employees` where `employment_status_id` = 'b7b5e4a6-e405-498f-bec9-c3989abdd41b' and `employees`.`deleted_at` is null
select count(*) as aggregate from `employees` where `employment_status_id` = '213c345c-22f7-403c-8d84-d93b7a524479' and `employees`.`deleted_at` is null
---
    protected function getData(): array
    {
        // Hitung jumlah pegawai berdasarkan employment_status_id
        $pegawaiCount = Employees::where('employment_status_id', '60918c6d-f161-4a7c-a33b-29231dc23013')->count();
        $calonPegawaiCount = Employees::where('employment_status_id', 'b7b5e4a6-e405-498f-bec9-c3989abdd41b')->count();
        $kontrakCount = Employees::where('employment_status_id', '213c345c-22f7-403c-8d84-d93b7a524479')->count();