app/Filament/Widgets/TotalWidget.php

    protected function getStats(): array
    {
        $totalAssets = Asset::count();
        $totalEmployees = Employees::count();

        $totalAmount = MoneyVoucherReturns::whereMonth('date_voucher_returns', Carbon::now()->month)
            ->whereYear('date_voucher_returns', Carbon::now()->year)
            ->sum('total_amount');
---
select count(*) as aggregate from `assets`
select count(*) as aggregate from `employees` where `employees`.`deleted_at` is null
select sum(`total_amount`) as aggregate from `money_voucher_returns` where month(`date_voucher_returns`) = '11' and year(`date_voucher_returns`) = 2024