app/Filament/Widgets/UsersWidget.php

select count(*) as aggregate from `users`
---
    protected function getStats(): array
    {
        $TotalUser = User::count();