app/Filament/Resources/AssetResource/Pages/ListAssets.php

select `id`, `name` from `master_assets_condition`
select count(*) as aggregate from `assets`
---
    public function getTabs(): array
    {
        // Ambil semua data kondisi dari tabel master_assets_condition
        $conditions = DB::table('master_assets_condition')->pluck('id', 'name');

        // Inisialisasi array tabs dengan entri default 'Semua'
        $tabs = [
            'Semua' => Tab::make()->badge(function () {
                return Asset::count(); // Total semua aset