app/Filament/Resources/EmployeeTrainingResource/Widgets/TrainingOverview.php

    protected function getStats(): array
    {
        $total = EmployeeTraining::count();
        $totalThisYear = EmployeeTraining::whereYear('training_date', Carbon::now()->year)->count();
        $totalThisMonth = EmployeeTraining::whereYear('training_date', Carbon::now()->year)
            ->whereMonth('training_date', Carbon::now()->month)
            ->count();
        $totalToday = EmployeeTraining::whereDate('training_date', Carbon::today())->count();
---
select count(*) as aggregate from `employee_training` where `employee_training`.`deleted_at` is null
select count(*) as aggregate from `employee_training` where year(`training_date`) = 2024 and `employee_training`.`deleted_at` is null
select count(*) as aggregate from `employee_training` where year(`training_date`) = 2024 and month(`training_date`) = '11' and `employee_training`.`deleted_at` is null
select count(*) as aggregate from `employee_training` where date(`training_date`) = '2024-11-11' and `employee_training`.`deleted_at` is null