app/Http/Controllers/AssignmentLetterNumberController.php

    public function generateRegistrationNumber()
    {
        $currentYear = date('Y');
        $currentMonth = date('n');
        $romanMonth = $this->convertToRoman($currentMonth);

        // Get the total count of EmployeeAssignmentLetters for the current year
        $totalLetters = EmployeeAssignmentLetters::whereYear('created_at', $currentYear)->count();
---
select count(*) as aggregate from `employee_assignment_letters` where year(`created_at`) = '2024' and `employee_assignment_letters`.`deleted_at` is null