app/Filament/Resources/AssetMutationResource.php

select * from `assets`
---
    public static function form(Form $form): Form
    {
        return $form
            ->schema([
                Forms\Components\Section::make('Form Mutasi Aset')
                    ->description('Form input mutasi aset')
                    ->schema([
                        Forms\Components\TextInput::make('mutations_number')
                            ->label('Nomor Mutasi Aset')
                            ->required()
                            ->rules('required|string|max:255'),

                        Forms\Components\DatePicker::make('mutation_date')
                            ->label('Tanggal Mutasi')
                            ->required()
                            ->rules('required|date'),

                        Forms\Components\Select::make('transaction_status_id')
                            ->relationship('AssetsMutationtransactionStatus', 'name')
                            ->label('Status Mutasi')
                            ->searchable()
                            ->preload()
                            ->required()
                            ->rules('required|exists:asset_transaction_statuses,id'),

                        Forms\Components\Select::make('assets_id')
                            ->label('Nomor Aset')
                            ->searchable()
                            ->required()
                            ->rules('required|exists:assets,id')
                            ->getOptionLabelUsing(function ($record) {
                                return $record->assets_number . ' | ' . $record->name; // Format label yang ditampilkan
                            })
                            ->getOptionValueUsing(function ($record) {
                                return $record->id; // Nilai yang disimpan
                            })
                            ->options(function ($search) {
                                return Asset::query()
                                    ->when($search, function ($query, $search) {
                                        $query->where('assets_number', 'like', "%{$search}%")
                                            ->orWhere('name', 'like', "%{$search}%");
                                    })
                                    ->limit(10) // Batasi jumlah hasil untuk menghindari beban berlebih
                                    ->get();
                            })
                            ->afterStateUpdated(function ($set, $state) {
                                $aset = Asset::find($state);
                                if ($aset) {
                                    $set('assets_number', $aset->assets_number);