app/Filament/Resources/AssetDisposalResource.php

    public static function table(Table $table): Table
    {
        return $table
        ->headerActions([
            Tables\Actions\BulkAction::make('Export Pdf') // Action untuk download PDF yang sudah difilter
                ->icon('heroicon-m-arrow-down-tray')
                ->deselectRecordsAfterCompletion()
                ->action(function (\Illuminate\Database\Eloquent\Collection $records) {
                    // Ambil data karyawan yang memiliki jabatan 'Kepala Sub Bagian Kerumahtanggaan'
                    $employee = Employees::whereHas('employeePosition', function ($query) {
                        $query->where('name', 'Kepala Sub Bagian Kerumahtanggaan');
                    })->first();

                    // Render PDF dengan data records dan employee
                    return response()->streamDownload(function () use ($records, $employee) {
                        $pdfContent = Blade::render('pdf.report_asset_disposal', [
                            'records' => $records,
                            'employee' => $employee
                        ]);
                        echo Pdf::loadHTML($pdfContent)
                            ->setPaper('A4', 'landscape') // Set ukuran kertas dan orientasi
                            ->stream();
                    }, 'disposal_assets.pdf');
---
select `employees`.`id`, `employees`.`name` from `employees` inner join `master_employee_position` on `employees`.`employee_position_id` = `master_employee_position`.`id` where `master_employee_position`.`name` like '%kepala bagian umum%'