app/Filament/Resources/EmployeeAgreementResource.php

select * from `employee_job_application_archives`
select * from `employee_job_application_archives` where `application_status` = 0 and `employee_job_application_archives`.`deleted_at` is null
---
    public static function form(Form $form): Form
    {
        return $form
            ->schema([
                Section::make('Form Perjanjian Kontrak Pegawai')
                    ->description('Input data perjanjian kontrak pegawai.')
                    ->schema([
                        TextInput::make('agreement_number')
                            ->label('Nomor Perjanjian Kontrak')
                            ->maxLength(255)
                            ->required()
                            ->unique(ignoreRecord: true)
                            ->validationAttribute('Nomor Perjanjian Kontrak')
                            ->rules(['string', 'max:255', 'regex:/^[A-Za-z0-9\/-]+$/'])
                            ->placeholder('Contoh: PK/2024/001')
                            ->validationMessages([
                                'required' => 'Nomor Perjanjian Kontrak wajib diisi',
                                'max' => 'Nomor Perjanjian Kontrak tidak boleh lebih dari 255 karakter',
                                'unique' => 'Nomor Perjanjian Kontrak sudah digunakan',
                                'regex' => 'Format Nomor Perjanjian Kontrak tidak valid'
                            ]),

                        Select::make('job_application_archives_id')
                            ->options(function () {
                                return EmployeeJobApplicationArchives::query()
                                    ->where('application_status', false)
                                    ->get()
                                    ->mapWithKeys(function ($archive) {
                                        return [$archive->id => $archive->registration_number . ' | ' . $archive->name];
                                    })
                                    ->toArray();
                            })
                            ->afterStateUpdated(function (callable $set, $state) {
                                $archive = EmployeeJobApplicationArchives::find($state);

select * from `master_employee_grade` where `master_employee_grade`.`id` in ('0c4e85d5-394e-48c8-8d59-53fac5cf51bb', '209ec363-79d0-4451-98a9-9877b22dbc53', '5b1000be-23a5-4b6c-8e74-a9cdbad8969e', '5c3f27ca-88a0-456e-afb7-f751fb8c9773', '90ba8cf6-6c35-4371-b09a-2337c6191a34', 'b207e890-0538-4fba-b39e-051528c3b7af', 'b9a1ce6b-a6ef-436e-b459-3d12e94ba9d0', 'c08d7a62-9b6a-4423-abc0-87a97bac4fcf', 'c0cf1421-c521-4940-a467-bebce6bb8dc5', 'd34bb08e-cab9-4832-8bb0-a2f363a5b318', 'd8d4d0ab-63c5-45e4-b360-628f6ef02c94', 'f1453207-11d7-4aa3-98f5-5391b8ae9337')
select `master_employee_basic_salary`.* from `master_employee_basic_salary` inner join `master_employee_grade` on `master_employee_basic_salary`.`employee_grade_id` = `master_employee_grade`.`id` inner join `master_employee_service_grade` on `master_employee_basic_salary`.`employee_service_grade_id` = `master_employee_service_grade`.`id` order by `master_employee_grade`.`name` asc, CAST(master_employee_service_grade.service_grade AS UNSIGNED)
---
                        Select::make('basic_salary_id')
                            ->label('Pilih Golongan dan Gaji Pokok')
                            ->options(function () {
                                return MasterEmployeeBasicSalary::query()
                                    ->with(['employeeGrade', 'serviceGrade'])
                                    ->join('master_employee_grade', 'master_employee_basic_salary.employee_grade_id', '=', 'master_employee_grade.id')
                                    ->join('master_employee_service_grade', 'master_employee_basic_salary.employee_service_grade_id', '=', 'master_employee_service_grade.id')
                                    ->orderBy('master_employee_grade.name')
                                    ->orderByRaw('CAST(master_employee_service_grade.service_grade AS UNSIGNED)') // Modified this line
                                    ->select('master_employee_basic_salary.*')
                                    ->get()
                                    ->mapWithKeys(function ($basicSalary) {
                                        return [
                                            $basicSalary->id => "Golongan: {$basicSalary->employeeGrade->name} | MKG: {$basicSalary->serviceGrade->service_grade} - Gaji Pokok: Rp " . number_format($basicSalary->amount, 0, ',', '.')
                                        ];
                                    });