app/Filament/Resources/EmployeePromotionResource.php

    public static function form(Form $form): Form
    {
        return $form
            ->schema([
                Forms\Components\Section::make('Form Kenaikan Golongan Pegawai')
                    ->description('Form input kenaikan golongan pegawai')
                    ->schema([
                        Forms\Components\TextInput::make('decision_letter_number')
                            ->label('Nomor Surat Keputusan')
                            ->required(),
                        Forms\Components\DatePicker::make('promotion_date')
                            ->label('Tanggal Kenaikan Golongan')
                            ->required(),
                        Forms\Components\Select::make('employee_id')
                            ->options(Employees::query()->pluck('name', 'id'))
                            ->afterStateUpdated(function ($set, $state) {
                                $employees = Employees::find($state);
                                $set('name', $employees->name);
                                $set('old_grade_id', $employees->employee_grade_id);
                                $set('old_basic_salary', $employees->basic_salary);
                            })
                            ->label('Nama Pegawai')
                            ->searchable()
                            ->preload()
                            ->live()
                            ->required(),
---
select `name`, `id` from `employees` where `employees`.`deleted_at` is null
select * from `employees` where `employees`.`id` = '9d6df6d4-e44e-4361-8d84-2bca2c4c052c' and `employees`.`deleted_at` is null limit 1

                            ->label('Gaji Pokok Lama (Hidden)')
                            ->dehydrated(),

                        Forms\Components\Select::make('new_grade_id')
                            ->label('Golongan Baru')
                            ->searchable()
                            ->options(MasterEmployeeBasicSalary::query()->pluck('name', 'id'))  // Kembalikan ke id
                            ->required()
                            ->live()
                            ->afterStateUpdated(function ($state, callable $set) {
                                if ($state) {
                                    $basicSalary = MasterEmployeeBasicSalary::find($state);  // Query tetap menggunakan id
                                    $set('new_basic_salary', $basicSalary?->amount);
                                    $set('new_basic_salary_hidden', $basicSalary?->amount);
                                } else {
                                    $set('new_basic_salary', null);
                                    $set('new_basic_salary_hidden', null);
                                }
                            }),
---
select `name`, `id` from `master_employee_basic_salary`

    public static function table(Table $table): Table
    {
        return $table
        ->headerActions([
            Tables\Actions\BulkAction::make('Export Pdf')
                ->icon('heroicon-m-arrow-down-tray')
                ->deselectRecordsAfterCompletion()
                ->action(function (\Illuminate\Database\Eloquent\Collection $records) {
                    // Ambil data karyawan yang memiliki jabatan 'Kepala Sub Bagian Kepegawaian'
                    $employees = Employees::whereHas('employeePosition', function ($query) {
                        $query->where('name', 'Kepala Sub Bagian Kepegawaian');
                    })->first();
---
select * from `employees` where exists (select * from `master_employee_position` where `employees`.`employee_position_id` = `master_employee_position`.`id` and `name` = 'Kepala Sub Bagian Kepegawaian') and `employees`.`deleted_at` is null limit 1