app/Filament/Resources/EmployeeAgreementResource.php


                        Select::make('basic_salary_id')
                            ->label('Pilih Golongan dan Gaji Pokok')
                            ->options(function () {
                                return MasterEmployeeBasicSalary::query()
                                    ->with('employeeGrade')
                                    ->get()
                                    ->mapWithKeys(function ($basicSalary) {
                                        return [
                                            $basicSalary->id => "Golongan: {$basicSalary->employeeGrade->name} - Gaji Pokok: Rp " . number_format($basicSalary->amount, 0, ',', '.')
                                        ];
                                    });
                            })
                            ->reactive()
                            ->afterStateUpdated(function ($state, Forms\Set $set) {
                                if ($state) {
                                    $basicSalary = MasterEmployeeBasicSalary::with('employeeGrade')->find($state);
                                    $set('grade_id', $basicSalary->employeeGrade->name);
                                    $set('amount', number_format($basicSalary->amount, 0, ',', '.'));
                                } else {
                                    $set('grade_id', null);
                                    $set('amount', null);
                                }
                            }),
---
select * from `master_employee_basic_salary`
select * from `master_employee_grade` where `master_employee_grade`.`id` in ('969e334a-066a-4b46-b471-9e0b4a9d56f7', 'd1ed787d-5419-475b-b137-2d09afafce57')