app/Filament/Resources/EmployeeBusinessTravelLettersResource.php

                        Forms\Components\Select::make('employee_signatory_id')
                            ->relationship('employeeSignatory', 'name')
                            ->label('Pejabat Penandatangan')
                            ->required()
                            ->searchable()
                            ->preload()
                            ->options(function () {
                                return Employees::whereHas('employeePosition', function ($query) {
                                    $query->where('name', 'like', '%direktur utama%')
                                        ->orWhere('name', 'like', '%direktur umum%')
                                        ->orWhere('name', 'like', '%kepala bagian umum%');
                                })->get()->mapWithKeys(function ($employee) {
                                    return [
                                        $employee->id => $employee->name . ' | ' . $employee->employeePosition->name
                                    ];
                                });
                            }),
                        Forms\Components\Textarea::make('description')
                            ->label('Detail Tugas')
                            ->columnSpanFull(),
                        Forms\Components\Hidden::make('users_id')
                            ->default(auth()->id()),
                    ])
            ]);
---
select * from `employees` where exists (select * from `master_employee_position` where `employees`.`employee_position_id` = `master_employee_position`.`id` and `name` = 'Kepala Sub Bagian Kepegawaian') and `employees`.`deleted_at` is null limit 1
select * from `employees` where exists (select * from `master_employee_position` where `employees`.`employee_position_id` = `master_employee_position`.`id` and (`name` like '%direktur utama%' or `name` like '%direktur umum%' or `name` like '%kepala bagian umum%')) and `employees`.`deleted_at` is null
select * from `master_employee_position` where `master_employee_position`.`id` = 'cf8f0f15-bb86-4725-bf24-57dacc7e1675' limit 1