app/Filament/Resources/EmployeeAssignmentLettersResource.php

select `name`, `id` from `employees` where `employees`.`deleted_at` is null
---
    public static function form(Form $form): Form
    {

        $assignmentLetterNumberController = new AssignmentLetterNumberController();

        return $form
            ->schema([
                Section::make('Form Surat Tugas')
                    ->description('Input data surat tugas.')
                    ->schema([
                        Forms\Components\TextInput::make('registration_number')
                            ->label('Nomor Surat')
                            ->required()
                            ->default($assignmentLetterNumberController->generateRegistrationNumber())
                            ->maxLength(255),
                        Forms\Components\Select::make('assigning_employee_id')
                            ->options(Employees::query()->pluck('name', 'id'))
                            ->afterStateUpdated(function ($set, $state) {
                                $employees = Employees::find($state);
                                $set('employee_position_id', $employees->employee_position_id);
                            })
                            ->relationship('aassigningEmployee', 'name')
                            ->label('Pemberi Tugas')
                            ->required()
                            ->searchable()
                            ->preload()
                            ->live(),