app/Filament/Resources/MasterEmployeeGradeBenefitResource.php

select * from `master_employee_grade`
---
    public static function form(Form $form): Form
    {
        return $form
            ->schema([
                Section::make('Form Golongan Tunjangan')
                    ->description('Kelola data golongan tunjangan')
                    ->schema([
                        Forms\Components\Select::make('grade_id')
                            ->options(
                                MasterEmployeeGrade::all()
                                    ->sortBy(function ($grade) {
                                        return [
                                            $grade->name,
                                        ];
                                    })
                                    ->mapWithKeys(function ($grade) {
                                        return [$grade->id => "{$grade->name}"];
                                    })
                            )
                            ->label('Golongan')
                            ->searchable()
                            ->preload()
                            ->required()
                            ->validationMessages([
                                'required' => 'Silakan pilih golongan',
                            ])
                            ->helperText('Pilih golongan untuk menambahkan tunjangan'),

                        Forms\Components\Repeater::make('benefits')
                            ->schema([

select `name`, `id` from `master_employee_benefit` where `id` not in ('8f3a03df-efdd-41c8-93e1-9e6713625cd0', 'c2f540b6-2cd1-44e7-ba4f-1502c4729234')
---
                                        }

                                        // Return benefit yang belum dipilih
                                        return MasterEmployeeBenefit::query()
                                            ->whereNotIn('id', $selectedBenefits)
                                            ->pluck('name', 'id');

select * from `master_employee_benefit` where `master_employee_benefit`.`id` = '41a762d3-57df-4705-821e-b2c53568ac26' limit 1
---
                            ->itemLabel(
                                fn(array $state): ?string =>
                                isset($state['benefit_id'])
                                    ? MasterEmployeeBenefit::find($state['benefit_id'])?->name ?? 'Tunjangan'

select * from `master_employee_benefit` where `master_employee_benefit`.`id` = 'c2f540b6-2cd1-44e7-ba4f-1502c4729234' limit 1
---

                    return collect($record->benefits)
                        ->filter(function ($benefit) use ($benefitType) {
                            $masterBenefit = MasterEmployeeBenefit::find($benefit['benefit_id']);